app/Controllers/Bayar.php

UPDATE `transaksi` SET `status` = 1, `updated_at` = '2024-08-08 07:17:02'
WHERE `transaksi_id` = 16
---
    public function bayar(): string
    {
        $id = intval($this->request->getPost('id'));
        $transaksi = new TransaksiModel;
        $transaksi->where('transaksi_id',$id)->set([
            "status" => 1
        ])->update();