app/Controllers/Dashboard.php

SELECT *
FROM `transaksi`
JOIN `customer` ON `transaksi`.`customer_id` = `customer`.`customer_id`
JOIN `detail_transaksi` ON `transaksi`.`transaksi_id` = `detail_transaksi`.`transaksi_id`
---
    public function index(): string
    {
        $transaksiModel = new TransaksiModel();
        $data['transaksi'] = $transaksiModel->join('customer', 'transaksi.customer_id = customer.customer_id')->join('detail_transaksi', 'transaksi.transaksi_id = detail_transaksi.transaksi_id')->findAll();