app/Controllers/Login.php

    public function proses_login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1