app/Controllers/Transaksi.php

    public function index(): string
    {
        // Get Data detail transaksi

        $data['detail_transaksi'] = $this->detailTransaksi->join('transaksi', 'detail_transaksi.transaksi_id = transaksi.transaksi_id')->join('barang', 'detail_transaksi.barang_id = barang.barang_id')->where('transaksi.status', 0)->findAll();
        // dd($data['detail_transaksi']);
        // Gete Data transaksi

        $data['transaksi'] = $this->transaksi->where('status', 0)->findAll();
        $data['condition'] = $this->transaksi->where('status', 0)->builder()->countAllResults();

        // dd($data['condition']);
        if($data['condition'] == 0){
            $this->transaksi->insert([
                "customer_id" => 1,
                "total_transaksi" => 0,
                "status" => 0
            ]);
        }
        $idTransaksi = $this->transaksi->builder()->select('transaksi_id')->orderBy('transaksi_id','DESC')->limit(1)->get()->getResultArray();
        $data['transaksi_id'] = intval($idTransaksi[0]['transaksi_id']);
        $totalTransaksi = $this->transaksi->select('total_transaksi')->where('transaksi_id',$data['transaksi_id'])->findAll();
---
SELECT *
FROM `detail_transaksi`
JOIN `transaksi` ON `detail_transaksi`.`transaksi_id` = `transaksi`.`transaksi_id`
JOIN `barang` ON `detail_transaksi`.`barang_id` = `barang`.`barang_id`
WHERE `transaksi`.`status` = 0
SELECT *
FROM `transaksi`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `status` = 0
SELECT `transaksi_id`
FROM `transaksi`
ORDER BY `transaksi_id` DESC
 LIMIT 1
SELECT `total_transaksi`
FROM `transaksi`
WHERE `transaksi_id` = 15

    public function barang(): string
    {
        // Get Data barang

        $data['barang'] = $this->barang->findAll();
---
SELECT *
FROM `barang`

    public function tambah(): string
    {
        // Get data detail transaks
        $data['transaksi'] = $this->transaksi->where('status', 0)->findAll();
        $this->transaksiid = $this->transaksi->where('status', 0)->select('transaksi_id')->findAll();
        $data['transaksi_id'] = intval($this->transaksiid[0]["transaksi_id"]);

        $harga = $this->barang->where('barang_id', $this->request->getPost('barangid'))->select('harga')->find();
        $totalHarga = intval($harga[0]["harga"]) * $this->request->getPost('jumlah');
        // dd(intval($data['transaksi_id'][0]["transaksi_id"]));

        $this->detailTransaksi->insert([
            "transaksi_id" => $data['transaksi_id'],
            "barang_id" => $this->request->getPost('barangid'),
            "jumlah_satuan" => $this->request->getPost('jumlah'),
            "total_harga" => $totalHarga
        ]);

        $totalTransaksi = $this->detailTransaksi->where('transaksi_id',$data['transaksi_id'])->builder()->selectsum('total_harga')->get()->getResultArray();
        $intTotalTransaksi = $totalTransaksi[0]["total_harga"];
        // dd($intTotalTransaksi);

        $this->transaksi->where('transaksi_id',$data['transaksi_id'])->set([
            "total_transaksi" => $intTotalTransaksi,
        ])->update();

        $data['total_transaksi'] = intval($intTotalTransaksi);
        $data['detail_transaksi'] = $this->detailTransaksi->join('transaksi', 'detail_transaksi.transaksi_id = transaksi.transaksi_id')->join('barang', 'detail_transaksi.barang_id = barang.barang_id')->where('transaksi.status', 0)->findAll();
---
SELECT *
FROM `transaksi`
WHERE `status` = 0
SELECT `transaksi_id`
FROM `transaksi`
WHERE `status` = 0
SELECT `harga`
FROM `barang`
WHERE `barang_id` = '3'
INSERT INTO `detail_transaksi` (`transaksi_id`, `barang_id`, `jumlah_satuan`, `total_harga`, `created_at`, `updated_at`) VALUES (24, '3', '2', 7000, '2024-08-09 20:45:10', '2024-08-09 20:45:10')
SELECT SUM(`total_harga`) AS `total_harga`
FROM `detail_transaksi`
WHERE `transaksi_id` = 24
UPDATE `transaksi` SET `total_transaksi` = '7000', `updated_at` = '2024-08-09 20:45:10'
WHERE `transaksi_id` = 24
SELECT *
FROM `detail_transaksi`
JOIN `transaksi` ON `detail_transaksi`.`transaksi_id` = `transaksi`.`transaksi_id`
JOIN `barang` ON `detail_transaksi`.`barang_id` = `barang`.`barang_id`
WHERE `transaksi`.`status` = 0

    public function cancel($id)
    {
        // $id = intval($this->request->getPost('id'));
        // dd($id);

        $this->transaksi->builder()->where('transaksi_id', $id)->delete();
---
DELETE FROM `transaksi`
WHERE `transaksi_id` = 17

    public function cek_member()
    {
        $valid = false;
        $member = [];
        $data['member'] = $this->customer->where('nama_customer', $this->request->getPost('member'))->first();
---
SELECT *
FROM `customer`
WHERE `nama_customer` = 'irfan'
 LIMIT 1

    public function hapus($id)
    {
        $this->transaksi->where('transaksi_id',$id)->set([
            "status" => 2,
        ])->update();
---
UPDATE `transaksi` SET `status` = 2, `updated_at` = '2024-08-09 20:40:24'
WHERE `transaksi_id` = '23'